Repository: maurerpe/repsnapper
Catalog: po/*.po
Languages: de_de

source: Unrecognized file -
de_de: unbekannte Datei:

source: Known extensions:
de_de: Bekannte Erw.:

source: Error: Unable to open file -
de_de: Fehler: Kann Datei nicht öffnen:

source: Error: Unable to open stl file -
de_de: Fehler: Kann STL-Datei nicht öffnen:

source: Unexpected EOF reading STL file -
de_de: Dateiende beim Lesen der STL-Datei -

source: Unnamed
de_de: Unbenannt

source: Error: Facet keyword not found in STL text!
de_de: Fehler: kein "Facet" in STL

source: Error: normal keyword not found in STL text!
de_de: Fehler: kein "normal" in STL

source: Error: Outer/Loop keywords not found!
de_de: Fehler: Kein "outer/loop" gefunden

source: Error: Vertex keyword not found
de_de: Fehler: kein "Vertex"

source: Error: Endloop or endfacet keyword not found
de_de: Fehler: Kein "Endloop" oder "endfacet"

source: Error: Unable to open vrml file -
de_de: Fehler: kann VRML-Datei nich laden:

source: not yet implemented
de_de: noch nicht implementiert

source: Reading GCode
de_de: Lade GCode

source: Done
de_de: Fertig

source: Unnamed object
de_de: Unbenanntes Objekt

source: Cannot add a 3-dimensional Shape to a 2-dimensional Model and vice versa
de_de: 3-dimensionales Objekt geht nicht zusammen mit 2-dimensionalem

source: Unsaved file
de_de: Ungespeicherte Datei

source: Usage: repsnapper [OPTION]... [FILE]... Start reprap control software and load [FILES] Options: -t, --no-gui act as a head-less renderer -i, --input [file] read input Model [file] -b, --binary [file] batch convert input file to binary STL -o, --output [file] if not head-less (-t), enter non-printing GUI mode only able to output gcode to [file] --svg [file] slice to SVG file --ssvg [file] slice to single layer SVG files [file]NNNN.svg -s, --settings [file] read render settings [file] -h, --help show this help Report bugs to #repsnapper, irc.freenode.net
de_de: "Befehl: repsnapper [OPTION]... [DATEI]...\n" "Starte Programm und lade [DATEI]en\n" "Optionen:\n" " -t, --no-gui Kommandozeile, ohne grafische Oberfläche\n" " -i, --input [datei] von [datei] laden\n" " -b, --binary [datei] Konvertiere datei in binaeres STL\n" " -o, --output [datei] GCode in [datei] ausgeben\n" " ohne "-t": GUI-Modus für Pronterface\n" " --svg [datei] Schichten in SVG-Datei\n" " --ssvg [datei] Einzelschichten in SVG-Dateien [datei]NNNN.svg\n" " -s, --settings [datei] Einstellungen von [datei] laden\n" " -h, --help Hilfe anzeigen\n" "\n" "Bugs bitte melden in #repsnapper, irc.freenode.net\n" "\n"

source: Couldn't create user config directory!
de_de: Konnte Verzeichnis für Benutzer-Konfiguration nicht anlegen!

source: Couldn't find global configuration!
de_de: Konnte Grundeinstellung nicht finden!

source: It is likely that repsnapper is not correctly installed.
de_de: Wahrscheinlich wurde repsnapper nicht korrekt installiert.

source: Unable to create user config
de_de: Kann keine Benutzer-Konfiguration erstellen

source: Falling back to global config. Settings will not be saved.
de_de: Setze auf Grundeinstellung zurück. Einstellungen werden nicht gespeichert

source: Failed to locate config
de_de: Kann Konfiguration nicht finden

source: No output file given
de_de: Keine Ausgabedatei angegeben

source: Failed to load settings from file '
de_de: Konnte Einstellungen nicht einlesen: '

source: Exception
de_de: Fehler

source: loading settings from file '
de_de: beim einlesen der Datei '

source: Parsing config from '
de_de: Lese Einstellungen von '

source: Missing user interface item
de_de: GUI-Element fehlt:

source: Shape has volume
de_de: Teil hat ein Volumen von

source: mm^3 and
de_de: mm^3 und

source: triangles
de_de: Dreiecke

source: Split Shapes
de_de: Teilen

source: Split: Sorting Triangles ...
de_de: Dreicke sortieren ...

source: Split: Building shapes ...
de_de: Zerlegen ...

source: Shape
de_de: Teil

source: Disconnecting...
de_de: Trenne ...

source: Connect
de_de: Verbinden

source: Connecting...
de_de: Verbinde ...

source: Disconnect
de_de: Trennen

source: All Files
de_de: Alle Dateien

source: Models
de_de: Modelle

source: Settings
de_de: Einstellungen

source: Model
de_de: Modell

source: Load
de_de: Lade

source: Save
de_de: Speichere

source: done in
de_de: fertig

source: seconds
de_de: Sek

source: Nozzle:
de_de: Düse:

source: Bed:
de_de: Plattform:

source: Target:
de_de: Sollwert:

source: Off
de_de: Aus

source: On
de_de: An

source: Home
de_de: Startposition

source: Complete print before converting
de_de: Druck fertigstellen vor Umwandlung

source: Converting to GCode while printing will abort the print
de_de: GCode-Erstellung würde den laufenden Druck abbrechen

source: Complete print before reading
de_de: Druck fertigstellen vor dem Einlesen

source: Reading GCode while printing will abort the print
de_de: GCode zu laden, würde den Druck abbrechen

source: Overwrite File?
de_de: Datei überschreiben?

source: Error reading UI description!!
de_de: Fehler in UI-Beschreibung!!

source: Couldn't find UI description!
de_de: Keine UI-Beschreibung gefunden!

source: Check that repsnapper has been correctly installed.
de_de: Installation überprüfen

source: Error loading UI!
de_de: Fehler beim Laden der UI-Beschreibung!

source: Printing
de_de: Druckt

source: Reset Printer?
de_de: Drucker zurücksetzen?

source: Output File:
de_de: Ausgabedatei:

source: Can't switch power while printing
de_de: Kann nicht ein- oder ausschalten, während gedruckt wird

source: Can't go home while printing
de_de: Kann nicht in Ausgangsposition, während gedruckt wird

source: Home called with unknown axis
de_de: Ausgangsposition ohne Achse?

source: Move called with unknown axis
de_de: Bewegung mit unbekannter Achse

source: _About
de_de: Ü_ber

source: _Calibrate
de_de: _Kalibrieren

source: repsnapper Preferences
de_de: repsnapper-Einstellungen

source: Settings set
de_de: Einstellungen

source: Summary of Hardware Settings
de_de: Gerät

source: Change image
de_de: Bild ändern

source: Save Settings
de_de: Einstellungen speichern

source: Clone Settings
de_de: Einstellungen speichern

source: Summary
de_de: Zusammenfassung

source: Border
de_de: Rand

source: Build Volume
de_de: Volumen

source: <b>Geometry</b>
de_de: <b>Geometrie</b>

source: X/Y Axes:
de_de: X/Y-Achsen:

source: Z Axis:
de_de: Z-Achse:

source: <b>Axis Moving Speeds (mm/sec)</b>
de_de: <b>Achsengeschwindigkeiten (mm/s)</b>

source: Serial Link Speed
de_de: Geschwindigkeit der seriellen Schnittstelle

source: Number of lines of output to retain for each scrollback buffer
de_de: Zeilenanzahl, die im Puffer bleiben soll

source: lines
de_de: Zeilen

source: <b>Serial Communications</b>
de_de: <b>Schnittstellenkommunikation</b>

source: Send Speed on Every GCode Command
de_de: Geschwindigkeit mit jedem GCode-Befehl

source: Hardware Settings
de_de: Gerät

source: Relative Ecode
de_de: Relativer E-Code

source: Use T Command to Change Extruder
de_de: Extruderwechsel mit T-Befehl

source: Otherwise use different GCode Letters
de_de: Andernfalls mit verschiedenen GCode-Zeichen

source: <b>General</b>
de_de: <b>Allgemein</b>

source: Copy
de_de: Kopieren

source: Remove
de_de: Entfernen

source: Use this Extruder for Support
de_de: Diesen Extruder für Gerüst verwenden

source: Extrusion Multiplier
de_de: Gesamtextrudierfaktor

source: Minimum Line Width (~Nozzle Diameter)
de_de: Minimale Linienbreite (~Düsendurchmesser)

source: Maximum Line Width (~Nozzle Diameter)
de_de: Maximale Linienbreite (~Düsendurchmesser)

source: GCode Letter
de_de: GCode-Zeichen

source: Display Colour
de_de: Farbe

source: Calibrate mm as input
de_de: mm des Filaments

source: Filament Diameter
de_de: Filamentdurchmesser

source: <b>Extruder Settings</b>
de_de: <b>Extruder-Einstellungen</b>

source: Extruded Lines
de_de: Extrudierte Linien

source: Shells
de_de: Hüllen

source: <b>Speeds (mm/sec)</b>
de_de: <b>Geschwindigkeiten (mm/s)</b>

source: Enable Antiooze Retract
de_de: Filamentrückzug aktivieren

source: Minimum Distance (mm):
de_de: Ab Distanz (mm):

source: Speed (mm/sec):
de_de: Geschwindigkeit (mm/s):

source: Amount (mm):
de_de: Rückzug (mm):

source: Z lift on move (mm):
de_de: Anheben bei Bewegung (mm):

source: Lift Z on all moves
de_de: Alle Bewegungen anheben

source: Extruders
de_de: Extruder

source: Rotation per Layer (°):
de_de: Drehung pro Schicht (°):

source: Normal Fill:
de_de: Normale Füllung:

source: Solid Fill:
de_de: Volle Füllung:

source: Extrusion Factor:
de_de: Extrusionsfaktor:

source: Support:
de_de: Gerüst:

source: Widen:
de_de: Verbreitern:

source: Base Rotation (°):
de_de: Gesamtdrehung (°):

source: Decoration:
de_de: Dekor:

source: Infill Distance:
de_de: Füllungsabstand:

source: Rotation:
de_de: Drehung:

source: Alternate Infill every
de_de: Alternative Füllung jede

source: th Layer
de_de: te Schicht

source: Alternate Infill Percent:
de_de: Alternative Füllung (%):

source: Bridges Extrusion Factor:
de_de: Brücken-Extrusionsfaktor:

source: Infill Overlap:
de_de: Füllungsüberhang:

source: Disable Bridges
de_de: Brücken deaktivieren

source: Make enough solid layers to reach minimum thickness (mm)
de_de: So viele Schichten erzeugen, wie für diese Dicke benötigt werden (mm)

source: Solid Thickness:
de_de: Voll füllen bis

source: Decor Layers:
de_de: Dekorschichten:

source: Min. Angle:
de_de: Min. Winkel

source: <b>Infill</b>
de_de: <b>Füllung</b>

source: Infill
de_de: Füllung

source: Offset Outer Shells by (mm):
de_de: Außenhülle versetzen (mm):

source: Variable Slicing
de_de: Variable Schichten

source: Height (mm):
de_de: Höhe (mm):

source: Distance (mm):
de_de: Abstand (mm):

source: Arcs GCode (G2,G3)
de_de: GCode-Bögen (G2,G3)

source: Max. Angles:
de_de: Max. Winkel

source: Round Corners
de_de: Ecken abrunden

source: Distance
de_de: Abstand

source: Min. Arc Length (mm):
de_de: Ab Bogenlänge (mm)

source: Move between nearest points of polygons
de_de: Bewegung nach kürzester Verbindung

source: Fill Skirt Area
de_de: Skirt füllen

source: Around All Objects
de_de: Um alle Objekte

source: Always done when using Support
de_de: Immer wenn Gerüst verwendet wird

source: Minimum Time per Layer (s):
de_de: Mindestzeit pro Schicht (s):

source: Fan Control
de_de: Lüftersteuerung

source: Min. Speed:
de_de: Min. Geschw.

source: Max. Speed:
de_de: Max. Geschw.

source: Max. Overhang Speed (mm/sec):
de_de: Max. Geschw. bei Überhang (mm/s):

source: Minimum Shell Time (s):
de_de: Mindestzeit pro Hülle (s):

source: <b>Cooling</b>
de_de: <b>Kühlung</b>

source: Number of first Layers:
de_de: Anzahl Grundschichten

source: Speed Ratio:
de_de: Rel. Geschwindigkeit:

source: Minimum Infill Distance (line widths)
de_de: Minimaler Füllungsabstand (Linienbreiten)

source: Very First Layer Height Ratio
de_de: Rel. Höhe der allerersten Schicht

source: <b>First Layer(s)</b>
de_de: <b>Erste Schicht(en)</b>

source: Enable Acceleration
de_de: Beschleunigung aktivieren

source: Acceleration Distance:
de_de: Beschleunigungsstrecke

source: <b>Acceleration</b>
de_de: <b>Beschleunigung</b>

source: Optimization
de_de: Optimierung

source: Enable Raft
de_de: Unterlage erstellen

source: Larger Than Object (mm)
de_de: Größer als Objekt (mm)

source: Rotation per Layer
de_de: Drehung pro Schicht

source: Temperature Ratio
de_de: Temperaturverhältnis

source: Thickness Ratio
de_de: Schichtdickenverhältnis

source: Distance Between Lines
de_de: Abstand zwischen Linien

source: Rotation
de_de: Drehung

source: Extrusion Ratio
de_de: Extrusionsfaktor

source: Number of Layers
de_de: Anzahl Schichten

source: <b>Base</b>
de_de: <b>Unterlage</b>

source: <b>Interface</b>
de_de: <b>Zwischenschicht</b>

source: <b>Raft</b>
de_de: <b>Unterlage</b>

source: Raft
de_de: Unterlage

source: Tool Diameter
de_de: Werkzeugdurchmesser

source: Milling Settings
de_de: Fräsen

source: Colour
de_de: Farbe

source: Choose Wireframe Colour
de_de: Drahtmodellfarbe

source: Choose Normals Colour
de_de: Normalenfarbe

source: Choose Endpoints Colour
de_de: Endpunktfarbe

source: Choose Polygon Colour
de_de: Polygonfarbe

source: Highlight Strength
de_de: Stärke der Hervorhebung

source: Length
de_de: Länge

source: Size
de_de: Größe

source: Shade Wireframe
de_de: Drahtmodell schattieren

source: Polygons
de_de: Polygone

source: Wireframe
de_de: Drahtmodell

source: Normals
de_de: Normalen

source: Endpoints
de_de: Endpunkte

source: <b>STL Rendering Colors</b>
de_de: <b>STL-Darstellung</b>

source: Adjust Luminance to Indicate Speed
de_de: Geschwindigkeit durch Luminanz darstellen

source: Move Head Colour
de_de: Farbe Bewegung

source: Choose Head Movement Colour
de_de: Bewegungsfarbe

source: GCode when Printing
de_de: GCode, während gedruckt wird

source: Preview/Live Extrude Color
de_de: Vorschau/Live-Extrudierfarbe

source: Choose Extrusion Colour
de_de: Extrusionsfarbe

source: <b>GCode Rendering</b>
de_de: <b>GCode-Darstellung</b>

source: Enable Lights
de_de: Beleuchtung aktivieren

source: <b>Lighting</b>
de_de: <b>Beleuchtung</b>

source: Display Settings
de_de: Ansicht

source: Enable Debug
de_de: Debuggen

source: Speeds are handled as mm/sec
de_de: Geschwindigkeiten in mm/s

source: Draw Polygon Numbers
de_de: Polygonnummern zeigen

source: Draw Line Numbers
de_de: Liniennummern zeigen

source: Draw Vertex Numbers
de_de: Punktnummern zeigen

source: Show Layer Overhang Areas
de_de: Überhänge zeigen

source: Randomize Lines
de_de: Linien randomisieren

source: Fill Layer Areas
de_de: Schichten füllen

source: <b>Layer Debug</b>
de_de: <b>Schichten-Debug</b>

source: Debug Infill
de_de: Füllung Debuggen

source: <b>Infill Debug</b>
de_de: <b>Füllung debuggen</b>

source: Debug Arcs
de_de: Bögen debuggen

source: Show Extruder Number on GCode
de_de: Extruder-Nummer bei GCode zeigen

source: Show GCode with Extruder Offset
de_de: GCode mit Extruder-Versatz zeigen

source: <b>Debug GCode</b>
de_de: <b>GCode debuggen</b>

source: Serial comms debug
de_de: Schittstelle debuggen

source: <b>Comms Debug</b>
de_de: <b>Kommunikation debuggen</b>

source: Output Progress to Terminal
de_de: Status im Terminal ausgeben

source: <b>Output</b>
de_de: <b>Ausgabe</b>

source: Debug
de_de: Debuggen

source: Fullscreen
de_de: Vollbild

source: Load Settings
de_de: Einstellungen laden

source: Load application settings profile
de_de: Konfigurationsdatei laden

source: Load _GCode
de_de: _GCode laden

source: Load GCode
de_de: GCode laden

source: Load a file of control codes
de_de: Lädt eine GCode-Datei

source: Load _STL
de_de: _STL laden

source: Load STL
de_de: STL laden

source: Load an STL file
de_de: STL laden

source: _Preferences
de_de: _Einstellungen

source: Preferences
de_de: _Einstellungen

source: Open the Preferences Dialog
de_de: Öffnet den Einstellungsdialog

source: _Quit
de_de: Beenden

source: Quit
de_de: Beenden

source: Exit Repsnapper
de_de: Repsnapper beenden

source: Save application settings profile
de_de: Konfigurationsdatei speichern

source: Save Settings As
de_de: Einstellungen speichern unter ...

source: Save settings in a custom file
de_de: Konfigurationsdatei angeben

source: LGPLv2+, GPLv2+, and other licenses, see licenses.txt
de_de: LGPLv2+, GPLv2+ und andere Lizenzen, siehe licenses.txt

source: Custom Button
de_de: Eigener Befehl

source: _File
de_de: _Datei

source: _Edit
de_de: _Bearbeiten

source: _Help
de_de: _Hilfe

source: _Support
de_de: Gerüs_t

source: No Covers
de_de: Ohne Abdeckung

source: Decor
de_de: Dekor

source: Selected Only
de_de: Nur markierte

source: Serial _Build
de_de: Se_riell erstellen

source: Save GCode and Close
de_de: GCode speichern und Ende

source: Progress
de_de: Status

source: Generate _GCode
de_de: _GCode erzeugen

source: Preview
de_de: Vorschau

source: Single Layer SVGs
de_de: Einzelne Schichten

source: Save STL as Single Object
de_de: Alles als ein Gesamtobjekt speichern

source: Files
de_de: Dateien

source: Load Model
de_de: Modell laden

source: _Autoplace
de_de: _Autom. platzieren

source: Save as STL/AMF
de_de: Modell als STL/AMF speichern

source: Slice to S_VG
de_de: Schichten-SVG

source: Delete
de_de: Löschen

source: D_uplicate
de_de: D_uplizieren

source: Split
de_de: Teilen

source: Merge
de_de: Vereinigen

source: Divide
de_de: Aufteilen

source: Rotate:
de_de: Drehen:

source: Translate:
de_de: Verschieben:

source: Scale:
de_de: Skalieren:

source: On Platform
de_de: Auf Plattform

source: Mirror
de_de: Spiegeln

source: Hollow
de_de: Hohlform

source: Invert Normals
de_de: Normalen umkehren

source: Twist:
de_de: Verdrehen:

source: <b>Object</b>
de_de: <b>Objekt</b>

source: Surface Normals
de_de: Flächennormalen

source: Bounding Boxes
de_de: Begrenzungen

source: Surface
de_de: Oberfläche

source: Display
de_de: Anzeige

source: Shells:
de_de: Hüllen:

source: Infill %
de_de: Füllung %

source: <b>Parameters</b>
de_de: <b>Parameter</b>

source: _Load GCode
de_de: GCode laden

source: To Platform
de_de: Auf Plattform

source: _Save GCode
de_de: GCode speichern

source: Start
de_de: Starten

source: Next Layer
de_de: Schichtwechsel

source: End
de_de: Ende

source: Result
de_de: Ergebnis

source: Print
de_de: Drucken

source: Home All
de_de: Alle in Ausgangsposition

source: Reset Printer
de_de: Drucker zurücksetzen

source: Reset
de_de: Zurücksetzen

source: Power On
de_de: Anschalten

source: <b>Printer</b>
de_de: <b>Drucker</b>

source: Amount (mm)
de_de: Rückzug (mm)

source: Axis Control
de_de: Achsensteuerung

source: Use Extruder:
de_de: Extruder:

source: Update Interval (sec)
de_de: Aktualisierung (s)

source: Monitor Temperature
de_de: Temp. überwachen

source: Fan Enabled
de_de: Lüfter an

source: Fan Level
de_de: Lüfterstärke

source: <b>Temperature</b>
de_de: <b>Temperatur</b>

source: Length (mm)
de_de: Länge (mm)

source: Speed (mm/s)
de_de: Geschwindigkeit (mm/s):

source: Purge
de_de: Auswerfen

source: New
de_de: Neu

source: Edit
de_de: Bearbeiten

source: <b>Custom Actions</b>
de_de: <b>Eigene Befehle</b>

source: Send GCode
de_de: GCode senden

source: Printer
de_de: Drucker

source: Clear on Print Start
de_de: Vor Drucken löschen

source: Clear Now
de_de: Alles Löschen

source: Communication
de_de: Kommunikation

source: Errors/Warnings
de_de: Fehler/Warnungen

source: Draw Layers
de_de: Schichten zeigen

source: All
de_de: Alle

source: Dimensions
de_de: Maße

source: Height:
de_de: Höhe:

source: Draw GCode
de_de: GCode zeigen

source: Moves
de_de: Bewegungen

source: Arrows
de_de: Pfeile

source: Borders
de_de: Rand

source: From/Single:
de_de: Von/Einzeln:

source: To:
de_de: Bis:

source: Layer Preview
de_de: Vorschau
