{"materials": {"ABS": {"description": "A tough structural plasitc, ABS is a good choice for engineering applications.  It glues easily with regular CA superglues and can be welded with acetone.  However, it tends to warp and curl making it difficult to print.  A heated bed is a necessity and a heat build chamber is best.  Curling is minimized by using the \"cross\" infill pattern and switching off the cooling fan.  Using \"brim\" for adhesion helps hold the print down to the bed.  Spray the build plate with hairspray such as Aquanet before printing.",
                       "nozzle-feedrate": [[0.4,
                                            25]],
                       "settings": {"#active": {"default_material_print_temperature": 235,
                                                "material_print_temperature_layer_0": 245},
                                    "#global": {"adhesion_type": "brim",
                                                "cool_fan_enabled": false,
                                                "infill_pattern": "cross",
                                                "material_bed_temperature": 100}}},
               "NYLON": {"description": "A good strong engineering plastic with a very low coeficent of friction.  Good for moving or sliding parts.  Smear some gluestick onto the build plate before printing.  Virtually impossible to glue or paint.  Can be joined with solderinging welding or spin welding.  Generally comes in white, but prints can be dyed with RIT brand or similar dyes.  Nylon absorbs water from the air over time.  This water causes bubbles and irregularies in the print.   Store nylon in sealed container packed with desecant between uses.  Alternately, bake in the oven before each use.",
                         "nozzle-feedrate": [[0.4,
                                              25]],
                         "settings": {"#active": {"default_material_print_temperature": 240},
                                      "#global": {"material_bed_temperature": 80}}},
               "PETG": {"description": "Descent engineering plastic.  Can be glued with dichloromethane based glues such as SciGrip 16 (not available in all countries).  Stringy and readily adhears to itself.  Print with low widght\/height ratio (around 1.2) and underflow the material to reduce strings.  Spray the build plate with hairspray such as Aquanet before printing.",
                        "nozzle-feedrate": [[0.4,
                                             1]],
                        "settings": {"#active": {"default_material_print_temperature": 235},
                                     "#global": {"material_bed_temperature": 70,
                                                 "material_flow": 90}},
                        "width\/height": 1.2},
               "PLA": {"description": "PLA is the go-to plastic for art and decrititve prints and is an ok engineering plastic.  It prints easily due to low warpage.  Does overhands well and great for bridging.  Available in a huge wealth of colors.  Adhesion can be peformed with dichloromethane glues such as SciGrip16.  Can also be soldering iron welded or spin welded.  Print with fan on maximum to get the most out of bridging and overhangs.  Spray the build plate with hair spray (such as Auqanet) before each print.",
                       "nozzle-feedrate": [[0.4,
                                            25]],
                       "settings": {"#active": {"default_material_print_temperature": 200},
                                    "#global": {"material_bed_temperature": 60}}},
               "TPU": {"description": "The most readily avaiable flexible, rubbery plastic for 3D printers.  Gluing is very tricky due to its flexible nature.  Soldering iron welding works.  Must print very slowly.  Otherwise, the material compresses in the extruder and bowden tube causing oozing.  Spray the build plate with hairspray such as Aquanet before printing.",
                       "nozzle-feedrate": [[0.4,
                                            0.5]],
                       "settings": {"#active": {"default_material_print_temperature": 220,
                                                "material_print_temperature_layer_0": 225},
                                    "#global": {"material_bed_temperature": 70}}}},
 "quality": {"Fast": {"height\/nozzle": 1,
                      "settings": {},
                      "speed": 120,
                      "wall-speed-ratio": 0.5,
                      "width\/height": 1.8},
             "Fine": {"height\/nozzle": 0.5,
                      "settings": {"#global": {"infill_pattern": "triangles"}},
                      "speed": 60,
                      "wall-speed-ratio": 0.5,
                      "width\/height": 1.6},
             "Normal": {"height\/nozzle": 0.75,
                        "settings": {"#global": {"infill_pattern": "triangles"}},
                        "speed": 60,
                        "wall-speed-ratio": 0.5,
                        "width\/height": 1.8}}}